incompressible/dpEqn_Semi-Implicit_GCIBM_Inplace-Robin/case/0/gas/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    TOP
    {
        type            zeroGradient;
    }

    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    AROUND
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
